{
  "TEMPLATE_014 | Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых приведена в таблице. (Отсутствие числа в таблице означает, что прямой дороги между пунктами нет.) Определите длину кратчайшего пути между пунктами A и F (при условии, что передвигаться можно только по построенным дорогам).": [
    "03AF88",
    "0A852D",
    "0BB548",
    "0eB2F8",
    "21c1Bc",
    "258ec0",
    "27A3D5",
    "376e1A",
    "3B3eB2",
    "3eF5A1",
    "476F7F",
    "4F8F88",
    "4ec2BD",
    "56341D",
    "59722e",
    "59FF2B",
    "B1945B",
    "BBDA07",
    "Be70Ae",
    "c0c201",
    "cB9A99",
    "ceDBc4",
    "e6c4BF",
    "eB3c58",
    "eB806A",
    "ee8F64",
    "03D82F",
    "049363",
    "0A35e7",
    "266919",
    "2779c7",
    "2c23c9",
    "3104cc",
    "391A6e",
    "3B607F",
    "41413F",
    "455ec1",
    "4c4357",
    "504A41",
    "59A9e8",
    "B5886A",
    "B66c94",
    "c0FFc3",
    "c77360",
    "cA76F6",
    "e3FF31",
    "eFA5B7",
    "3D3B2c",
    "3F4e75",
    "502F13",
    "5AeA27",
    "5ce6AF",
    "Be2035",
    "eF2A5F",
    "19D48B",
    "239F6D",
    "2B0587",
    "3F5A49",
    "757B6D",
    "8F35D7",
    "9FC9BA",
    "036DD5",
    "082471",
    "18347B",
    "77221C",
    "94C722",
    "A30887",
    "014AC5",
    "167DE9",
    "2B21CF",
    "DB83E7",
    "2217A5",
    "2CA604",
    "D97770",
    "DBA59C",
    "E87B75"
  ],
  "TEMPLATE_091 | Документ объёмом <num> Мбайт можно передать с одного компьютера на другой двумя способами: А. Сжать архиватором, передать архив по каналу связи, распаковать. Б. Передать по каналу связи без использования архиватора. Какой способ быстрее и насколько, если: средняя скорость передачи данных по каналу связи составляет <num> <num> бит в секунду; объём сжатого архиватором документа равен <num>% исходного; время, требуемое…": [
    "2D06Bc",
    "2DD896",
    "324B96",
    "344B58",
    "3A944A",
    "3AF04B",
    "3eABFD",
    "5c34DD",
    "B30D55",
    "B528A0",
    "B702F1",
    "c468cA",
    "c8495c",
    "e123e3",
    "e44e18",
    "0c966c",
    "47c32e",
    "4cB9B2",
    "50AB5D",
    "5c31BD",
    "B0912D",
    "B93013",
    "Bec068",
    "c0FeB8",
    "cc454A",
    "e0e3D2",
    "ecB1D1",
    "3474DA",
    "57BDEB",
    "57FB71",
    "867D3A",
    "A0B91B",
    "A2232B",
    "B058BB",
    "D25D7B",
    "E8C741",
    "04eFc0",
    "0A04DD",
    "368338",
    "47e19A",
    "579B34",
    "595e30",
    "eF44D2",
    "ec1ccA",
    "308F47",
    "Bc342e",
    "35DF04",
    "c8eD0e",
    "eF0000",
    "2DDF63",
    "41ece4",
    "54B442",
    "47e49c",
    "4cAD3D",
    "502BcF",
    "57579A"
  ],
  "TEMPLATE_359 | В некоторой стране автомобильный номер длиной <num> символов составляют из заглавных букв (используется <num> различных букв) и любых десятичных цифр. Буквы с цифрами могут следовать в любом порядке. Каждый такой номер в компьютерной программе записывается минимально возможным и одинаковым целым количеством байт (при этом используют посимвольное кодирование и все символы кодируются одинаковым и минимально возможным…": [
    "00F883",
    "018294",
    "04F49F",
    "254Ac3",
    "35F2cF",
    "526A11",
    "5622D7",
    "596FDc",
    "B0F9D6",
    "cD667c",
    "e3e495",
    "e46A49",
    "eF0383",
    "ee98A8",
    "38D4A7",
    "BD5cFB",
    "e24DD3",
    "0100D0",
    "0D0583",
    "B89610",
    "e8e0A0",
    "08190A",
    "258F81",
    "c3F754",
    "eD7e3A"
  ],

  "TEMPLATE_298 | Исполнитель преобразует число на экране. У исполнителя есть три команды, которые обозначены латинскими буквами: A . Прибавить <num> B . Прибавить <num> C . Умножить на <num> Программа для исполнителя – это последовательность команд. Сколько существует программ, для которых при исходном числе <num> результатом является число <num>, при этом траектория вычислений содержит число <num> и не содержит <num>? Траектория вы…": [
    "0B1894",
    "6C2CD5",
    "765FFF",
    "8F2A53",
    "A1A489",
    "CD3814",
    "D5434F",
    "064F20",
    "B17D75",
    "07D82e",
    "Ac8F45",
    "6CF4FF",
    "8271BC",
    "B3D150",
    "D785AA",
    "E51AA0",
    "EC38B4",
    "20B163",
    "ACD638",
    "B93319",
    "E35422",
    "018811",
    "43B305",
    "9A65F5",
    "C0C817",
    "C2EB01",
    "E9000D"
  ],
  "TEMPLATE_083 | Задание выполняется с использованием прилагаемых к заданию файлов. Дана последовательность из N натуральных чисел. Рассматриваются все её непрерывные подпоследовательности, такие что сумма элементов каждой из них кратна k = <num>. Найдите среди них подпоследовательность с максимальной суммой, определите её длину. Если таких подпоследовательностей найдено несколько, в ответе укажите количество элементов самой коротко…": [
    "072D53",
    "1D695E",
    "377100",
    "48B0C6",
    "9F4BD8",
    "F291D4"
  ],

  "TEMPLATE_281 | Задание выполняется с использованием прилагаемых к заданию файлов. Организация купила для своих сотрудников все места в нескольких подряд идущих рядах на концертной площадке. Известно, какие места уже распределены между сотрудниками. Найдите ряд с наибольшим номером, в котором есть два соседних места, таких что слева и справа от них в том же ряду места уже распределены (заняты). Гарантируется, что есть хотя бы один…": [
    "7F1EAA",
    "97FA8B",
    "BD5ECE",
    "BE60AB",
    "C3D450",
    "FC12A4"
  ],
  "TEMPLATE_335 | Логическая функция F задаётся выражением ¬x \\/ y \\/ ( ¬z /\\ w ). На рисунке приведён фрагмент таблицы истинности функции F , содержащий все наборы аргументов, при которых функция F ложна. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных w , x , y , z . Переменная <num> Переменная <num> Переменная <num> Переменная <num> Функция ??? ??? ??? ??? F <num> <num> <num> <num> <num>…": [
    "04F474",
    "08B86A",
    "7848B2",
    "985BA5",
    "BFA504",
    "F126F9"
  ],
  "TEMPLATE_082 | Сколько существует различных наборов значений логических переменных x <num> , x <num> , … x <num> , y <num> , y <num> , … y <num> , которые удовлетворяют всем приведённым ниже условиям? ( x i ∧ y j → x i ∧ y j + <num> ) ∧ ( x i ∧ y j → x i + <num> ∧ y j ) = <num> для всех натуральных i и j , таких, что i < <num> и j < <num>. Ниже для Вашего удобства приведены некоторые из равенств, соответствующих этим условиям. ( x…": [
    "3699F5",
    "36F1B5",
    "71F4D6",
    "D40516",
    "F578E5"
  ],
  "TEMPLATE_259 | Задание выполняется с использованием прилагаемых файлов. В магазине для упаковки подарков есть N кубических коробок. Самой интересной считается упаковка подарка по принципу матрёшки – подарок упаковывается в одну из коробок, та в свою очередь в другую коробку и т.д. Одну коробку можно поместить в другую, если длина её стороны хотя бы на <num> единиц меньше длины стороны другой коробки. Определите наибольшее количест…": [
    "0C1433",
    "1F25B2",
    "38235A",
    "584C6A",
    "B1F57A"
  ],
  "TEMPLATE_273 | На вход программы поступает последовательность из N целых положительных чисел, все числа в последовательности различны. Рассматриваются все пары различных элементов последовательности (элементы пары не обязаны стоять в последовательности рядом, порядок элементов в паре не важен). Необходимо определить количество пар, для которых произведение элементов делится на <num>. Описание входных и выходных данных В первой стр…": [
    "559E69",
    "902B84",
    "BCE6F1",
    "E3E824",
    "FB72C9"
  ],
  "TEMPLATE_330 | Задание выполняется с использованием прилагаемых файлов. Входной файл содержит сведения о заявках на проведение мероприятий в конференц-зале. В каждой заявке указаны время начала и время окончания мероприятия (в минутах от начала суток). Если время начала одного мероприятия меньше времени окончания другого, то провести можно только одно из них. Если время окончания одного мероприятия совпадает со временем начала дру…": [
    "3B2A3F",
    "A9339F",
    "B42224",
    "E53C3B",
    "EDE407"
  ],
  "TEMPLATE_005 | Задание выполняется с использованием прилагаемых файлов. У медицинской компании есть N пунктов приёма биоматериалов на анализ. Все пункты расположены вдоль автомагистрали и имеют номера, соответствующие расстоянию от нулевой отметки до конкретного пункта. Известно количество пробирок, которое ежедневно принимают в каждом из пунктов. Пробирки перевозят в специальных транспортировочных контейнерах вместимостью не боле…": [
    "0348F9",
    "2E1A79",
    "327EB5",
    "494D7D"
  ],
  "TEMPLATE_074 | Вычислите значение выражения <num> E <num> – <num> <num> . В ответе запишите вычисленное значение в десятичной системе счисления.": [
    "2E93BC",
    "300EF5",
    "33AB2D",
    "E59C76"
  ],
  "TEMPLATE_116 | Сколько существует различных наборов значений логических переменных x <num> , x <num> , ... x <num> , y <num> , y <num> , ... y <num> , которые удовлетворяют всем перечисленным ниже условиям? ( x <num> /\\ y <num> ) ≡ (¬ x <num> \\/ ¬ y <num> ) ( x <num> /\\ y <num> ) ≡ (¬ x <num> \\/ ¬ y <num> ) … ( x <num> /\\ y <num> ) ≡ (¬ x <num> \\/ ¬ y <num> ) В ответе не нужно перечислять все различные наборы значений переменных x…": [
    "085238",
    "1CA4C6",
    "492173",
    "68A28F"
  ],
  "TEMPLATE_225 | Символом F обозначено одно из указанных ниже логических выражений от трех аргументов: X, Y, Z. Дан фрагмент таблицы истинности выражения F: X Y Z F <num> <num> <num> <num> <num> <num> <num> <num> <num> <num> <num> <num> Какое выражение соответствует F?": [
    "4004D2",
    "44767D",
    "941A48",
    "FFAB6F"
  ],
  "TEMPLATE_034 | Задание выполняется с использованием прилагаемых файлов. По каналу связи передаётся последовательность целых неотрицательных чисел – показания прибора, полученные с интервалом в <num> мин. в течение T мин. ( T – целое число). Прибор измеряет количество атмосферных осадков, полученное регистратором за минуту, предшествующую моменту регистрации, и передаёт это значение в условных единицах измерения. Определите два так…": [
    "13F17F",
    "5ABB91",
    "6E6BDD"
  ],
  "TEMPLATE_045 | Сколько существует различных наборов значений логических переменных x <num> , x <num> , ... x <num> , y <num> , y <num> , ... y <num> , которые удовлетворяют всем перечисленным ниже условиям? ( x <num> \\/ y <num> ) → ( x <num> /\\ y <num> ) = <num> ( x <num> \\/ y <num> ) → ( x <num> /\\ y <num> ) = <num> … ( x <num> \\/ y <num> ) → ( x <num> /\\ y <num> ) = <num> В ответе не нужно перечислять все различные наборы значен…": [
    "1D8423",
    "36702C",
    "3F5D94"
  ],
  "TEMPLATE_062 | Задание выполняется с использованием прилагаемых файлов. Входной файл содержит заявки пассажиров, желающих сдать свой багаж в камеру хранения. В заявке указаны время сдачи багажа и время освобождения ячейки (в минутах от начала суток). Багаж одного пассажира размещается в одной свободной ячейке с минимальным номером. Ячейки пронумерованы начиная с единицы. Размещение багажа в ячейке или её освобождение происходит в…": [
    "290F15",
    "A99635",
    "B3C563"
  ],
  "TEMPLATE_064 | Дана последовательность N целых положительных чисел. Рассматриваются все пары элементов последовательности, разность которых чётна и, по крайней мере, один из элементов делится на p = <num>. Порядок элементов в паре неважен. Среди всех таких пар нужно найти и вывести пару с максимальной суммой элементов. Если одинаковую максимальную сумму имеет несколько пар, можно вывести любую из них. Если подходящих пар в последо…": [
    "04D7CD",
    "2931D9",
    "5D03DA"
  ],
  "TEMPLATE_068 | На вход программы поступает последовательность из N целых положительных чисел, все числа в последовательности различны. Рассматриваются все пары различных элементов последовательности, находящихся на расстоянии не меньше чем <num> (разница в индексах элементов пары должна быть <num> или более, порядок элементов в паре неважен). Необходимо определить количество таких пар, для которых произведение элементов делится на…": [
    "233FD1",
    "2C4C01",
    "37B022"
  ],
  "TEMPLATE_084 | В языке запросов поискового сервера для обозначения логической операции «ИЛИ» используется символ «|», а для обозначения логической операции «И» – символ «&». В таблице приведены запросы и количество найденных по ним страниц некоторого сегмента сети Интернет. Запрос Найдено страниц (в сотнях тысяч) Бабочка <num> Гусеница <num> Трактор <num> Трактор | Бабочка | Гусеница <num> Трактор & Гусеница <num> Трактор & Бабочк…": [
    "154FA8",
    "37C946",
    "900D56"
  ],
  "TEMPLATE_085 | Для регистрации на сайте некоторой страны пользователю требуется придумать пароль. Длина пароля – ровно <num> символов. В качестве символов могут быть использованы десятичные цифры и <num> различных букв местного алфавита, причём все буквы используются в двух начертаниях: как строчные, так и прописные (регистр буквы имеет значение). Под хранение каждого такого пароля на компьютере отводится одинаковое и минимально в…": [
    "380014",
    "5DBe2c",
    "eDeD5e"
  ],
  "TEMPLATE_113 | Рассматривается множество целых чисел, принадлежащих числовому отрезку [<num> <num>; <num> <num>], остаток от деления которых на <num> равен <num>, и при этом они не делятся ни на <num>, ни на <num>. Найдите количество таких чисел и максимальное из них. В ответе запишите два целых числа: сначала количество, затем максимальное число. Для выполнения этого задания можно написать программу или воспользоваться редактором…": [
    "47B24A",
    "5DBECC",
    "7582DC"
  ],
  "TEMPLATE_161 | Исполнитель преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера: <num>. Прибавить <num> <num>. Прибавить <num> <num>. Умножить на <num> Первая из них увеличивает число на экране на <num>, вторая увеличивает его на <num>, третья умножает на <num>. Программа для исполнителя – это последовательность команд. Сколько существует таких программ, которые преобразуют исходное чис…": [
    "0288EE",
    "313621",
    "62B10B"
  ],
  "TEMPLATE_175 | Вычислите значение выражения <num> F <num> – <num> <num> . В ответе запишите вычисленное значение в десятичной системе счисления.": [
    "644EA2",
    "6DED13",
    "8AD3E2"
  ],
  "TEMPLATE_207 | Для кодирования некоторой последовательности, состоящей из букв А, Б, В, Г, Д, Е, решили использовать неравномерный двоичный код, удовлетворяющий условию Фано. Для буквы А использовали кодовое слово <num>; для буквы Б – кодовое слово <num>. Какова наименьшая возможная сумма длин кодовых слов для букв В, Г, Д, Е? Примечание . Условие Фано означает, что никакое кодовое слово не является началом другого кодового слова.…": [
    "13BAE9",
    "8171DA",
    "DA3FC4"
  ],
  "TEMPLATE_217 | Световое табло состоит из лампочек, каждая из которых может находиться в двух состояниях («включено» или «выключено»). Какое наименьшее количество лампочек должно находиться на табло, чтобы с его помощью можно было передать <num> различных сигналов?": [
    "06F4A9",
    "28C6AB",
    "8AEE04"
  ],
  "TEMPLATE_261 | Сколько существует натуральных чисел x , для которых выполняется неравенство <num> <num> < x < <num> <num> ? В ответе укажите только количество чисел, сами числа писать не нужно.": [
    "533671",
    "B44A04",
    "E42756"
  ],
  "TEMPLATE_296 | Дан целочисленный массив из <num> элементов. Элементы массива могут принимать натуральные значения от <num> до <num> <num> включительно. Опишите на одном из языков программирования алгоритм, который находит минимум среди элементов массива, не делящихся нацело на <num>, а затем заменяет каждый элемент, не делящийся нацело на <num>, на число, равное найденному минимуму. Гарантируется, что хотя бы один такой элемент в…": [
    "1B61EA",
    "D26644",
    "D7E72A"
  ],
  "TEMPLATE_336 | Задание выполняется с использованием прилагаемых файлов. По каналу связи передаётся последовательность натуральных чисел – показания прибора. В течение N мин. ( N – натуральное число) прибор ежеминутно регистрирует значение напряжения (в условных единицах) в электрической сети и передаёт его на сервер. Определите три таких переданных числа, чтобы между моментами передачи любых двух из них прошло не менее K мин., а п…": [
    "522BD9",
    "EF3033",
    "F13E1D"
  ],
  "TEMPLATE_353 | В языке запросов поискового сервера для обозначения логической операции «ИЛИ» используется символ «|», а для обозначения логической операции «И» – символ «&». В таблице приведены запросы и количество найденных по ним страниц некоторого сегмента сети Интернет. Запрос Найдено страниц (в сотнях тысяч) Слон <num> Хобот <num> Ладья <num> Ладья | Слон | Хобот <num> Ладья & Слон <num> Ладья & Хобот <num> Какое количество с…": [
    "2DB736",
    "CE16A5",
    "FF78FC"
  ],

  "TEMPLATE_002 | Для хранения произвольного растрового изображения размером <num>×<num> пикселей отведено не более <num> Мбайт памяти без учёта размера заголовка файла. Для кодирования цвета каждого пикселя используется одинаковое количество бит, коды пикселей записываются в файл один за другим без промежутков. Какое максимальное количество цветов можно использовать в изображении?": [
    "017F78",
    "319214"
  ],
  "TEMPLATE_003 | В велокроссе участвуют <num> спортсменов. Специальное устройство регистрирует прохождение каждым из участников промежуточного финиша, записывая его номер с использованием минимально возможного количества бит, одинакового для каждого спортсмена. Каков размер записи, сделанной устройством в тот момент, когда промежуточный финиш прошли <num> велосипедистов?": [
    "02AF2D",
    "461FA3"
  ],
  "TEMPLATE_020 | На рисунке – схема дорог, связывающих города А, Б, В, Г, Д, Е, Ж, З, И, К, Л, М. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города А в город М, проходящих через город К?": [
    "0F204A",
    "1F5532"
  ],
  "TEMPLATE_021 | Документ (без упаковки) можно передать по каналу связи с одного компьютера на другой за <num> секунд. Если предварительно упаковать документ архиватором, передать упакованный документ, а потом распаковать на компьютере получателя, то общее время передачи (включая упаковку и распаковку) составит <num> секунд. Размер упакованного документа составляет <num>% размера исходного документа. Сколько всего времени ушло на уп…": [
    "0F4A18",
    "2c2cA5"
  ],
  "TEMPLATE_027 | Укажите через запятую в порядке возрастания все основания систем счисления, в которых запись числа <num> оканчивается на <num>.": [
    "11EBF6",
    "E7109F"
  ],
  "TEMPLATE_032 | Задание выполняется с использованием прилагаемых файлов. У медицинской компании есть N пунктов приёма биоматериалов на анализ. Все пункты расположены вдоль автомагистрали и имеют номера, соответствующие расстоянию от нулевой отметки до конкретного пункта. Известно количество пробирок, которое ежедневно принимают в каждом из пунктов. Компания планирует открыть лабораторию в одном из имеющихся пунктов. Перевозить биом…": [
    "12C4CF",
    "30C294"
  ],
  "TEMPLATE_047 | На числовой прямой даны два отрезка: B = [<num>; <num>] и C = [<num>; <num>]. Укажите наименьшую возможную длину такого отрезка A , что формула ( ¬ ( x ∈ B )) → ( (( x ∈ C ) /\\ ¬( x ∈ A )) → ( x ∈ B ) ) истинна, т.е. принимает значение <num> при любом значении переменной х.": [
    "1EF2C9",
    "D6A8C9"
  ],
  "TEMPLATE_052 | Для какого наибольшего целого неотрицательного числа A выражение ( x > A ) \\/ ( y > A ) \\/ ( x + <num> y < <num>) тождественно истинно, т.е. принимает значение <num> при любых целых неотрицательных x и y ?": [
    "23B72B",
    "969698"
  ],
  "TEMPLATE_053 | В марафоне участвуют <num> бегунов. Специальное устройство регистрирует прохождение каждым из спортсменов промежуточного финиша, записывая его номер с использованием минимально возможного количества бит, одинакового для каждого спортсмена. Какой объём памяти будет использован устройством, когда промежуточный финиш прошли <num> бегунов?": [
    "2411D7",
    "4Ac9eA"
  ],
  "TEMPLATE_055 | Сколько существует различных наборов значений логических переменных x <num> , x <num> , ... x <num> , y <num> , y <num> , ... y <num> , которые удовлетворяют всем перечисленным ниже условиям? ( ¬ x <num> \\/ y <num> ) → ( ¬ x <num> /\\ y <num> ) = <num> ( ¬ x <num> \\/ y <num> ) → ( ¬ x <num> /\\ y <num> ) = <num> … ( ¬ x <num> \\/ y <num> ) → ( ¬ x <num> /\\ y <num> ) = <num> В ответе не нужно перечислять все различные н…": [
    "24B976",
    "CF662F",
    "27734A",
    "940142"
  ],
  "TEMPLATE_065 | В языке запросов поискового сервера для обозначения логической операции «ИЛИ» используется символ «|», а для обозначения логической операции «И» – символ «&». В таблице приведены запросы и количество найденных по ним страниц некоторого сегмента сети Интернет. Запрос Найдено страниц (в сотнях тысяч) Горло <num> Корабль <num> Нос <num> Корабль & Нос <num> Горло & Нос <num> Горло & Корабль <num> Какое количество страни…": [
    "294C70",
    "4257BD"
  ],

  "TEMPLATE_077 | Дана последовательность N целых положительных чисел. Рассматриваются все пары элементов последовательности, удовлетворяющие следующим условиям: числа в паре имеют различные остатки от деления на d = <num>, и, по крайней мере, одно из чисел пары делится на p = <num>. Порядок элементов в паре неважен. Среди всех таких пар нужно найти и вывести пару с максимальной суммой элементов. Если одинаковую максимальную сумму им…": [
    "0B12A6",
    "335BFF"
  ],
  "TEMPLATE_078 | Для кодирования некоторой последовательности, состоящей из букв A , B , C , D , E , F , решили использовать неравномерный двоичный код, удовлетворяющий условию Фано. Для буквы A использовали кодовое слово <num>; для буквы B – кодовое слово <num>. Какова наименьшая возможная сумма длин кодовых слов для букв C , D , E , F ? Примечание . Условие Фано означает, что никакое кодовое слово не является началом другого кодов…": [
    "349C1D",
    "543CA7"
  ],
  "TEMPLATE_080 | На вход программы поступает последовательность из n целых положительных чисел. Рассматриваются все пары элементов последовательности a i и a j , такие что i < j и a i > a j (первый элемент пары больше второго, i и j – порядковые номера чисел в последовательности входных данных). Среди пар, удовлетворяющих этому условию, необходимо найти и напечатать пару с максимальной суммой элементов, которая делится на m = <num>.…": [
    "357E1D",
    "DBA49E"
  ],
  "TEMPLATE_087 | Задание выполняется с использованием прилагаемых файлов. Пусть S – последовательность из N целых чисел, пронумерованных подряд начиная с <num>. Обозначим S i , S j , S k три элемента последовательности S , где i < j < k . Определите в последовательности S три таких числа S i , S j , S k , что S i > S j , S k > S j и значение выражения ( S i – S j ) + ( S k – S j ) максимально. В ответе укажите найденное максимальное…": [
    "3169CC",
    "38414E"
  ],
  "TEMPLATE_096 | Вася составляет <num>-буквенные слова, в которых могут быть использованы только буквы В, И, Ш, Н, Я, причём буква В используется не более одного раза. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Слово не должно начинаться с буквы Ш и оканчиваться гласными буквами. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Скол…": [
    "4008B3",
    "FBFB6A"
  ],
  "TEMPLATE_099 | Обозначим через m & n поразрядную конъюнкцию неотрицательных целых чисел m и n . Так, например, <num> & <num> = <num> <num> & <num> <num> = <num> <num> = <num>. Для какого наименьшего неотрицательного целого числа А формула (( x & <num> ≠ <num>) /\\ ( x & <num> = <num>)) → ¬ ( x & А = <num>) тождественно истинна (т.е. принимает значение <num>) при любом неотрицательном целом значении переменной х ?": [
    "40A245",
    "ACD12F"
  ],
  "TEMPLATE_105 | Задание выполняется с использованием прилагаемых файлов. При онлайн-покупке билета на концерт известно, какие места в зале уже заняты. Необходимо купить билет на такое место в ряду, чтобы перед ним как можно больше идущих подряд кресел с таким же номером было свободно. Если места, удовлетворяющие этому условию, есть в нескольких рядах, то нужно выбрать ряд, расположенный как можно ближе к сцене. В ответе запишите дв…": [
    "4522EF",
    "4A2884"
  ],
  "TEMPLATE_130 | Вычислите значение выражения FE <num> – F <num> <num> . В ответе запишите вычисленное значение в десятичной системе счисления.": [
    "5168A5",
    "FD0462"
  ],
  "TEMPLATE_138 | На числовой прямой даны два отрезка: P = [<num>; <num>] и Q = [<num>; <num>]. Укажите наименьшую возможную длину такого отрезка A , что логическое выражение ( x ∈ P ) → ( (( x ∈ Q ) /\\ ¬( x ∈ A )) → ¬( x ∈ P ) ) истинно (т.е. принимает значение <num>) при любом значении переменной х.": [
    "43EF9F",
    "543526"
  ],
  "TEMPLATE_143 | Сколько существует различных наборов значений логических переменных x <num> , x <num> , … x <num> , y <num> , y <num> , … y <num> , которые удовлетворяют всем перечисленным ниже условиям? x <num> → y <num> = <num> ( x <num> → ( x <num> /\\ y <num> )) /\\ ( y <num> → y <num> ) = <num> ( x <num> → ( x <num> /\\ y <num> )) /\\ ( y <num> → y <num> ) = <num> … ( x <num> → ( x <num> /\\ y <num> )) /\\ ( y <num> → y <num> ) = <n…": [
    "387EA5",
    "562EAC"
  ],
  "TEMPLATE_145 | Два игрока играют в следующую игру. Перед ними лежат две кучки камней, в первой из которых <num>, а во второй – <num> камня. У каждого игрока неограниченно много камней. Игроки ходят по очереди. Ход состоит в том, что игрок или увеличивает в <num> раза число камней в какой-то куче, или добавляет <num> камня в какую-то кучу. Выигрывает игрок, после хода которого в одной из куч становится не менее <num> камней. Кто вы…": [
    "5787DA",
    "AC676E"
  ],
  "TEMPLATE_164 | Сколько единиц содержится в двоичной записи значения выражения: <num> <num> + <num> <num> – <num> ?": [
    "648024",
    "C35891"
  ],
  "TEMPLATE_178 | Дан целочисленный массив из <num> элементов. Элементы массива могут принимать натуральные значения от <num> до <num> <num> включительно. Опишите на одном из языков программирования алгоритм, который находит минимум среди элементов массива, делящихся нацело на <num>, а затем заменяет каждый элемент, делящийся нацело на <num>, на число, равное найденному минимуму. Гарантируется, что хотя бы один такой элемент в массив…": [
    "6F4A08",
    "C33970"
  ],
  "TEMPLATE_184 | Сколько единиц в двоичной записи шестнадцатеричного числа E <num> F <num> <num> ?": [
    "6D57A0",
    "714207"
  ],
  "TEMPLATE_187 | Количество значащих нулей в двоичной записи десятичного числа <num> равно": [
    "1DDE36",
    "74169D"
  ],
  "TEMPLATE_198 | Для какого наибольшего целого неотрицательного числа A выражение ( x + <num> y > A ) \\/ ( y < x ) \\/ ( x < <num>) тождественно истинно, т.е. принимает значение <num> при любых целых неотрицательных x и y ?": [
    "794FA3",
    "95C2C8"
  ],
  "TEMPLATE_203 | Дана последовательность N целых положительных чисел. Рассматриваются все пары элементов последовательности, разность которых чётна, и в этих парах, по крайней мере, одно из чисел пары делится на <num>. Порядок элементов в паре неважен. Среди всех таких пар нужно найти и вывести пару с максимальной суммой элементов. Если одинаковую максимальную сумму имеет несколько пар, можно вывести любую из них. Если подходящих па…": [
    "7BD738",
    "8F1330"
  ],
  "TEMPLATE_213 | Для игры, описанной в предыдущем задании, найдите два наименьших значения S , при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия: − Петя не может выиграть за один ход; − Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня. Найденные значения запишите в ответе в порядке возрастания.": [
    "6D762A",
    "878E85"
  ],
  "TEMPLATE_219 | В таблице приведена стоимость перевозок между соседними железнодорожными станциями. Укажите схему, соответствующую таблице. A B C D Е A <num> <num> <num> B <num> <num> C <num> <num> D <num> Е <num> <num>": [
    "1A48C1",
    "8DA527"
  ],
  "TEMPLATE_220 | Рассматривается множество целых чисел, принадлежащих числовому отрезку [<num> <num>; <num> <num>], которые делятся на <num> или <num> и не делятся на <num>, <num>, <num>. Найдите количество таких чисел и максимальное из них. В ответе запишите два целых числа: сначала количество, затем максимальное число. Для выполнения этого задания можно написать программу или воспользоваться редактором электронных таблиц.": [
    "4E04E7",
    "9098FE"
  ],
  "TEMPLATE_224 | Задание выполняется с использованием прилагаемых к заданию файлов. Текст комедии А.С. Грибоедова «Горе от ума» представлен в файлах различных форматов. Откройте один из файлов и определите, сколько раз, не считая сносок, встречается в тексте слово «батюшка» или «Батюшка». Другие формы слова «батюшка», такие как «батюшке», «батюшки» и т.д., учитывать не следует. В ответе укажите только число.": [
    "68E9C5",
    "93DEAB"
  ],
  "TEMPLATE_236 | В языке запросов поискового сервера для обозначения логической операции «ИЛИ» используется символ «|», а для обозначения логической операции «И» – символ «&». В таблице приведены запросы и количество найденных по ним страниц некоторого сегмента сети Интернет. Запрос Найдено страниц (в сотнях тысяч) Поле <num> Пшеница <num> Напряжённость <num> Поле & Пшеница <num> Напряжённость & Поле <num> Напряжённость & Пшеница <n…": [
    "0E40D9",
    "9B1CB1"
  ],
  "TEMPLATE_246 | Для какого наибольшего целого неотрицательного числа A выражение ( y + <num> x > A ) \\/ ( x < <num>) \\/ ( y < <num>) тождественно истинно, т.е. принимает значение <num> при любых целых неотрицательных x и y ?": [
    "A73FF2",
    "C38156"
  ],

  "TEMPLATE_258 | Для регистрации на сайте некоторой страны пользователю требуется придумать пароль. Длина пароля – ровно <num> символов. В качестве символов используются десятичные цифры и <num> различных букв местного алфавита, причём все буквы используются в двух начертаниях: как строчные, так и прописные (регистр буквы имеет значение!). Под хранение каждого такого пароля на компьютере отводится минимально возможное и одинаковое ц…": [
    "3e299A",
    "B1AF71"
  ],
  "TEMPLATE_260 | На числовой прямой даны два отрезка: P = [<num>; <num>] и Q = [<num>; <num>]. Укажите наименьшую возможную длину такого отрезка A , для которого логическое выражение ( x Î P ) → ( (( x Î Q ) /\\ ¬( x Î A )) → ¬( x Î P ) ) истинно (т.е. принимает значение <num>) при любом значении переменной х.": [
    "B3B99C",
    "D5D16C"
  ],
  "TEMPLATE_263 | Для какого наименьшего целого неотрицательного числа A выражение ( y + <num> x < A ) \\/ ( x > <num>) \\/ ( y > <num>) тождественно истинно, т.е. принимает значение <num> при любых целых неотрицательных x и y ?": [
    "2A7489",
    "B52794"
  ],
  "TEMPLATE_271 | Сколько единиц в двоичной записи числа <num>?": [
    "1C936F",
    "BA0D12"
  ],
  "TEMPLATE_277 | Сколько существует натуральных чисел x , для которых выполняется неравенство <num> B <num> < x < <num> F <num> ? В ответе укажите только количество чисел, сами числа писать не нужно.": [
    "C2A3AA",
    "C2FD97"
  ],
  "TEMPLATE_302 | Задание выполняется с использованием прилагаемых к заданию файлов. Откройте файл электронной таблицы, содержащей вещественные числа – результаты ежечасного измерения температуры воздуха в течение трёх месяцев. Найдите разность между максимальной температурой воздуха с <num> апреля по <num> мая с <num>:<num> до <num>:<num> включительно и средним значением температуры воздуха в эти часы в апреле и мае , используя данн…": [
    "98BEC9",
    "DA74F1"
  ],
  "TEMPLATE_306 | Исполнитель Чертёжник перемещается на координатной плоскости, оставляя след в виде линии. Чертёжник может выполнять команду сместиться на ( a , b ) , где a , b – целые числа. Эта команда перемещает Чертёжника из точки с координатами ( x , y ) в точку с координатами ( x + a , y + b ). Например, если Чертёжник находится в точке с координатами (<num>, <num>), то команда сместиться на (<num>, −<num>) переместит Чертёжни…": [
    "C5C059",
    "DCC8D9"
  ],
  "TEMPLATE_309 | Логическая функция F задаётся выражением ( х → y ) \\/ ¬( w → z ). На рисунке приведён фрагмент таблицы истинности функции F , содержащий все наборы аргументов, при которых функция F ложна. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных w , x , y , z . Переменная <num> Переменная <num> Переменная <num> Переменная <num> Функция F <num> <num> <num> <num> <num> <num> <num> <nu…": [
    "DFF2F9",
    "F65508"
  ],
  "TEMPLATE_315 | Ниже представлены два фрагмента таблиц из базы данных о жителях микрорайона. Каждая строка таблицы <num> содержит информацию о ребёнке и об одном из его родителей. Информация представлена значением поля ID в соответствующей строке таблицы <num>. Определите на основании приведённых данных, у скольких детей на момент их рождения матерям было больше <num> полных лет. При вычислении ответа учитывайте только информацию и…": [
    "E5AE75",
    "F6215E"
  ],
  "TEMPLATE_319 | Задание выполняется с использованием прилагаемых файлов. По каналу связи передаётся последовательность целых чисел – показания прибора. В течение N мин. ( N – натуральное число) прибор ежеминутно регистрирует значение напряжения (в условных единицах) в электрической сети и передаёт его на сервер. Определите три таких переданных числа, чтобы между моментами передачи любых двух из них прошло не менее K мин., а сумма э…": [
    "DD9960",
    "E8867C"
  ],
  "TEMPLATE_328 | На вход программы поступает последовательность из n целых положительных чисел. Рассматриваются все пары элементов последовательности a i и a j , такие что i < j и a i > a j (первый элемент пары больше второго, i и j – порядковые номера чисел в последовательности входных данных). Среди пар, удовлетворяющих этому условию, необходимо найти и напечатать пару с максимальной суммой элементов, которая делится на m = <num>.…": [
    "ECAE49",
    "F6FBF6"
  ],
  "TEMPLATE_329 | На вход программы поступает последовательность из N целых положительных чисел, все числа в последовательности различны. Рассматриваются все пары различных элементов последовательности, находящихся на расстоянии не меньше чем <num> (разница в индексах элементов пары должна быть <num> или более, порядок элементов в паре неважен). Необходимо определить количество таких пар, для которых произведение элементов делится на…": [
    "29FE86",
    "ED6EB9"
  ],
  "TEMPLATE_334 | В языке запросов поискового сервера для обозначения логической операции «ИЛИ» используется символ «|», а для обозначения логической операции «И» – символ «&». В таблице приведены запросы и количество найденных по ним страниц некоторого сегмента сети Интернет. Запрос Найдено страниц (в сотнях тысяч) Физика <num> Квант <num> Ньютон <num> Ньютон | Физика | Квант <num> Ньютон & Физика <num> Ньютон & Квант <num> Какое ко…": [
    "58F055",
    "F07905"
  ],
  "TEMPLATE_348 | Ниже представлены две таблицы из базы данных. Каждая строка таблицы <num> содержит информацию о ребёнке и об одном из его родителей. Информация представлена значением поля ID в соответствующей строке таблицы <num>. Определите на основании приведённых данных ID дедушки Аганян Б.Г. Примечание. Дедушка – это отец одного из родителей. Таблица <num> Таблица <num> ID Фамилия_И.О. Пол ID_Родителя ID_Ребёнка <num> Дурново И…": [
    "E11E94",
    "FDF14C"
  ],
  "TEMPLATE_354 | Исполнитель Чертёжник перемещается на координатной плоскости, оставляя след в виде линии. Чертёжник может выполнять команду сместиться на ( a , b ) , где a , b – целые числа. Эта команда перемещает Чертёжника из точки с координатами ( x , y ) в точку с координатами ( x + a , y + b ). Например, если Чертёжник находится в точке с координатами (<num>, <num>), то команда сместиться на (<num>, −<num>) переместит Чертёжни…": [
    "A13C82",
    "FFB86F"
  ]
}
