[
  {
    "id": "1.1",
    "text": "1.1 Основные тенденции развития компьютерных технологий. Параллельные вычисления. Многопроцессорные системы. Распределённые вычислительные системы и обработка больших данных",
    "section": 1
  },
  {
    "id": "1.2",
    "text": "1.2 Принципы построения и аппаратные компоненты компьютерных сетей. Сетевые протоколы. Сеть Интернет. Адресация в сети Интернет. Протоколы стека TCP/IP. Система доменных имён. Разделение IP-сети на подсети с помощью масок подсетей",
    "section": 1
  },
  {
    "id": "1.3",
    "text": "1.3 Файловая система. Поиск в файловой системе. Принципы размещения и именования файлов в долговременной памяти. Шаблоны для описания групп файлов",
    "section": 1
  },
  {
    "id": "1.4",
    "text": "1.4 Скорость передачи данных. Зависимость времени передачи от информационного объёма данных и характеристик канала связи",
    "section": 1
  },
  {
    "id": "2.1",
    "text": "2.1 Двоичное кодирование. Равномерные и неравномерные коды. Декодирование сообщений, записанных с помощью неравномерных кодов. Условие Фано. Построение однозначно декодируемых кодов с помощью дерева",
    "section": 2
  },
  {
    "id": "2.10",
    "text": "2.10 Модели и моделирование. Цели моделирования. Адекватность модели моделируемому объекту или процессу. Формализация прикладных задач. Представление результатов моделирования в виде, удобном для восприятия человеком. Графическое представление данных (схемы, таблицы, графики).",
    "section": 2
  },
  {
    "id": "2.11",
    "text": "2.11 Представление целых чисел в памяти компьютера. Ограниченность диапазона чисел при ограничении количества разрядов. Переполнение разрядной сетки. Беззнаковые и знаковые данные. Знаковый бит. Двоичный дополнительный код отрицательных чисел.Побитовые логические операции. Логический, арифметический и циклический сдвиги. Шифрование с помощью побитовой операции «исключающее ИЛИ»",
    "section": 2
  },
  {
    "id": "2.12",
    "text": "2.12 Представление вещественных чисел в памяти компьютера. Значащая часть и порядок числа. Диапазон значений вещественных чисел. Проблемы хранения вещественных чисел, связанные с ограничением количества разрядов. Выполнение операций с вещественными числами, накопление ошибок при вычислениях",
    "section": 2
  },
  {
    "id": "2.13",
    "text": "2.13 Графы. Основные понятия. Виды графов. Описание графов с помощью матриц смежности, весовых матриц, списков смежности. Решение алгоритмических задач, связанных с анализом графов (построение оптимального пути между вершинами графа, определение количества различных путей между вершинами ориентированного ациклического графа)",
    "section": 2
  },
  {
    "id": "2.14",
    "text": "2.14 Деревья. Бинарное дерево. Деревья поиска. Способы обхода дерева. Представление арифметических выражений в виде дерева. Использование графов и деревьев при описании объектов и процессов окружающего мира",
    "section": 2
  },
  {
    "id": "2.15",
    "text": "2.15 Дискретные игры двух игроков с полной информацией. Построение дерева перебора вариантов, описание стратегии игры в табличной форме. Выигрышные и проигрышные позиции. Выигрышные стратегии",
    "section": 2
  },
  {
    "id": "2.2",
    "text": "2.2 Теоретические подходы к оценке количества информации. Единицы измерения количества информации. Алфавитный подход к оценке количества информации. Закон аддитивности информации. Формула Хартли. Информация и вероятность. Формула Шеннона",
    "section": 2
  },
  {
    "id": "2.3",
    "text": "2.3 Системы счисления. Развёрнутая запись целых и дробных чисел в позиционной системе счисления. Свойства позиционной записи числа: количество цифр в записи, признак делимости числа на основание системы счисления. Алгоритм перевода целого числа из P-ичной системы счисления в десятичную. Алгоритм перевода конечной P-ичной дроби в десятичную. Алгоритм перевода целого числа из десятичной системы счисления в P-ичную. Перевод конечной десятичной дроби в P-ичную. Двоичная, восьмеричная и шестнадцатеричная системы счисления, связь между ними. Арифметические операции в позиционных системах счисления",
    "section": 2
  },
  {
    "id": "2.4",
    "text": "2.4 Троичная уравновешенная система счисления. Двоично-десятичная система счисления",
    "section": 2
  },
  {
    "id": "2.5",
    "text": "2.5 Кодирование текстов. Кодировка ASCII. Однобайтные кодировки. Стандарт UNICODE. Кодировка UTF-8. Определение информационного объёма текстовых сообщений",
    "section": 2
  },
  {
    "id": "2.6",
    "text": "2.6 Кодирование изображений. Оценка информационного объёма графических данных при заданных разрешении и глубине кодирования цвета. Цветовые модели. Кодирование звука. Оценка информационного объёма звуковых данных при заданных частоте дискретизации и разрядности кодирования",
    "section": 2
  },
  {
    "id": "2.7",
    "text": "2.7 Алгебра логики. Понятие высказывания. Высказывательные формы (предикаты). Кванторы существования и всеобщности. Логические операции. Таблицы истинности. Логические выражения. Логические тождества. Логические операции и операции над множествами. Законы алгебры логики. Эквивалентные преобразования логических выражений. Логические уравнения и системы уравнений. Логические функции. Зависимость количества возможных логических функций от количества аргументов. Канонические формы логических выражений",
    "section": 2
  },
  {
    "id": "2.8",
    "text": "2.8 Совершенные дизъюнктивные конъюнктивные нормальные формы, алгоритмы их построения по таблице истинности",
    "section": 2
  },
  {
    "id": "2.9",
    "text": "2.9 Логические элементы в составе компьютера. Триггер. Сумматор. Многоразрядный сумматор. Построение схем на логических элементах по заданному логическому выражению. Запись логического выражения по логической схеме",
    "section": 2
  },
  {
    "id": "3.1",
    "text": "3.1 Формализация понятия алгоритма. Машина Тьюринга как универсальная модель вычислений",
    "section": 3
  },
  {
    "id": "3.10",
    "text": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "section": 3
  },
  {
    "id": "3.11",
    "text": "3.11 Двумерные массивы (матрицы). Алгоритмы обработки двумерных массивов: заполнение двумерного числового массива по заданным правилам, поиск элемента в двумерном массиве, вычисление максимума (минимума) и суммы элементов двумерного массива, перестановка строк и столбцов двумерного массива",
    "section": 3
  },
  {
    "id": "3.12",
    "text": "3.12 Словари (ассоциативные массивы, отображения). Хэш-таблицы. Построение алфавитно-частотного словаря для заданного текста",
    "section": 3
  },
  {
    "id": "3.13",
    "text": "3.13 Стеки. Анализ правильности скобочного выражения. Вычисление арифметического выражения, записанного в постфиксной форме. Очереди. Использование очереди для временного хранения данных",
    "section": 3
  },
  {
    "id": "3.14",
    "text": "3.14 Алгоритмы на графах. Построение минимального остовного дерева взвешенного связного неориентированного графа. Количество различных путей между вершинами ориентированного ациклического графа. Алгоритм Дейкстры",
    "section": 3
  },
  {
    "id": "3.15",
    "text": "3.15 Деревья. Реализация дерева с помощью ссылочных структур. Двоичные (бинарные) деревья. Построение дерева для заданного арифметического выражения. Рекурсивные алгоритмы обхода дерева. Использование стека и очереди для обхода дерева",
    "section": 3
  },
  {
    "id": "3.16",
    "text": "3.16 Динамическое программирование как метод решения задач с сохранением промежуточных результатов. Задачи, решаемые с помощью динамического программирования: вычисление рекурсивных функций, подсчёт количества вариантов, задачи оптимизации",
    "section": 3
  },
  {
    "id": "3.17",
    "text": "3.17 Понятие об объектно-ориентированном программировании. Объекты и классы. Свойства и методы объектов. Объектно-ориентированный анализ. Разработка программ на основе объектно-ориентированного подхода. Инкапсуляция, наследование, полиморфизм",
    "section": 3
  },
  {
    "id": "3.2",
    "text": "3.2 Оценка сложности вычислений. Время работы и объём используемой памяти, их зависимость от размера исходных данных. Оценка асимптотической сложности алгоритмов. Алгоритмы полиномиальной сложности. Переборные алгоритмы. Примеры различных алгоритмов решения одной задачи, которые имеют различную сложность",
    "section": 3
  },
  {
    "id": "3.3",
    "text": "3.3 Определение возможных результатов работы простейших алгоритмов управления исполнителями и вычислительных алгоритмов. Определение исходных данных, при которых алгоритм может дать требуемый результат",
    "section": 3
  },
  {
    "id": "3.4",
    "text": "3.4 Алгоритмы обработки натуральных чисел, записанных в позиционных системах счисления: разбиение записи числа на отдельные цифры, нахождение суммы и произведения цифр, нахождение максимальной (минимальной) цифры. Представление числа в виде набора простых сомножителей. Алгоритм быстрого возведения в степень. Поиск простых чисел в заданном диапазоне с помощью алгоритма «решето Эратосфена»",
    "section": 3
  },
  {
    "id": "3.5",
    "text": "3.5 Многоразрядные целые числа, задачи длинной арифметики",
    "section": 3
  },
  {
    "id": "3.6",
    "text": "3.6 Язык программирования (Паскаль, Python, Java, C++, C#). Типы данных: целочисленные, вещественные, символьные, логические. Ветвления. Сложные условия. Циклы с условием. Циклы по переменной. Обработка данных, хранящихся в файлах. Текстовые и двоичные файлы. Файловые переменные (файловые указатели). Чтение из файла. Запись в файл. Разбиение задачи на подзадачи. Подпрограммы (процедуры и функции). Использование стандартной библиотеки языка программирования",
    "section": 3
  },
  {
    "id": "3.7",
    "text": "3.7 Рекурсия. Рекурсивные процедуры и функции. Использование стека для организации рекурсивных вызовов",
    "section": 3
  },
  {
    "id": "3.8",
    "text": "3.8 Численные методы. Точное и приближённое решения задачи. Численное решение уравнений с помощью подбора параметра. Численные методы решения уравнений: метод перебора, метод половинного деления. Приближённое вычисление длин кривых. Вычисление площадей фигур с помощью численных методов (метод прямоугольников, метод трапеций). Поиск максимума (минимума) функции одной переменной методом половинного деления",
    "section": 3
  },
  {
    "id": "3.9",
    "text": "3.9 Обработка символьных данных. Встроенные функции языка программирования для обработки символьных строк. Алгоритмы обработки символьных строк: подсчёт количества появлений символа в строке, разбиение строки на слова по пробельным символам, поиск подстроки внутри данной строки, замена найденной подстроки на другую строку. Генерация всех слов в некотором алфавите, удовлетворяющих заданным ограничениям. Преобразование числа в символьную строку и обратно",
    "section": 3
  },
  {
    "id": "4.1",
    "text": "4.1 Анализ данных. Основные задачи анализа данных: прогнозирование, классификация, кластеризация, анализ отклонений. Последовательность решения задач анализа данных: сбор первичных данных, очистка и оценка качества данных, выбор и/или построение модели, преобразование данных, визуализация данных, интерпретация результатов. Программные средства и интернет-сервисы для обработки и представления данных. Большие данные. Машинное обучение",
    "section": 4
  },
  {
    "id": "4.2",
    "text": "4.2 Анализ данных с помощью электронных таблиц. Вычисление суммы, среднего арифметического, наибольшего (наименьшего) значения диапазона. Вычисление коэффициента корреляции двух рядов данных. Построение столбчатых, линейчатых и круговых диаграмм. Построение графиков функций. Подбор линии тренда, решение задач прогнозирования. Решение задач оптимизации с помощью электронных таблиц",
    "section": 4
  },
  {
    "id": "4.3",
    "text": "4.3 Дискретизация при математическом моделировании непрерывных процессов. Моделирование движения. Моделирование биологических систем. Математические модели в экономике. Вычислительные эксперименты с моделями. Обработка результатов эксперимента. Метод наименьших квадратов. Оценка числовых параметров моделируемых объектов и процессов. Восстановление зависимостей по результатам эксперимента",
    "section": 4
  },
  {
    "id": "4.4",
    "text": "4.4 Вероятностные модели. Методы Монте-Карло. Имитационное моделирование. Системы массового обслуживания",
    "section": 4
  },
  {
    "id": "4.5",
    "text": "4.5 Табличные (реляционные) базы данных. Таблица – представление сведений об однотипных объектах. Поле, запись. Ключ таблицы. Работа с готовой базой данных. Заполнение базы данных. Поиск, сортировка и фильтрация данных. Запросы на выборку данных. Запросы с параметрами. Вычисляемые поля в запросах. Многотабличные базы данных. Типы связей между таблицами. Внешний ключ. Целостность базы данных. Запросы к многотабличным базам данных",
    "section": 4
  },
  {
    "id": "4.6",
    "text": "4.6 Текстовый процессор. Средства поиска и автозамены в текстовом процессоре. Структурированные текстовые документы. Сноски, оглавление. Правила цитирования источников и оформления библиографических ссылок",
    "section": 4
  }
]
